//パディング（0埋め）詰め  padding

const str1 = '5';

console.log(str1.padStart(2, '0'));
// expected output: "05"

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

const str1 = '5';

console.log(str1.padEnd(2, '0'));
// expected output: "50"

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

var str = `Javascriptの
ヒアドキュメント。
${a}とか${10*10} とやると式が計算されて文字列になります`

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

// slice：文字列.slice(開始位置 [,終了位置] )
var str = "0123456789";
str.slice(3); //"3456789"
str.slice(-2); //"89" 
str.slice(3, -1); //"345678"


// substr：文字列.substr(開始位置 [,切り出す長さ] )
var str = "0123456789";
str.substr(3); //"3456789" 
str.substr(1,5); //"12345" 
str.substr(-5,3)); //"567"


// substring：文字列.substring(開始位置 , 終了位置)
var str = "0123456789";
str.substring(3,7); //"3456"
str.substring(2,14); //"23456789" 
str.substring(3, -1); //"012"

//━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

